[
  {
    "Qualification": "Bachelor Of Arts (Ba) And Bachelor Of Social  \nScience (Bsocsc)",
    "Requirements": "NSC endorsed for degree study/ matric  \nexemption. FPS 380 with Academic Literacy NBT score at Intermediate Level. \n50% for English (HL) or 60% for English (FAL).",
    "FPS": "450"
  },
  {
    "Qualification": "Bachelor Of Social Science In Philosophy, Politics And \nEconomics (Bsocsc) (Ppe)",
    "Requirements": "NSC endorsed for degree study/ matric exemption. \nFPS 450 with Academic Literacy NBT score at Upper Intermediate and \nQuantitative Literacy NBT score at Upper Intermediate. NSC Mathematics 60%. \n50% for English (HL) or 60% for English (FAL).or above",
    "FPS": "450"
  },
  {
    "Qualification": "Bachelor Of Social Work (Bsw)",
    "Requirements": "NSC endorsed for degree study/ matric exemption. \nFPS 380 with Academic Literacy NBT score at Intermediate Level 50% for English (HL) \nor 60% for English (FAL).\nAdditional Requirements:  Applicants may be required to attend an \nadmissions interview and demonstrate successfully that they will meet the professional \nrequirements of the South African Council for Social Service Professionals.",
    "FPS": "450"
  },
  {
    "Qualification": "Bachelor Of Arts In Fine Art (Ba(Fa))",
    "Requirements": "NSC endorsed for degree study/ matric exemption.\nFPS 380 with Academic Literacy NBT score at Intermediate Level. 50% for English (HL) or \n60% for English (FAL).  Satisfactory performance in a portfolio evaluation.\nNote : The leading indicator for admission is performance in the audition, and places are \nawarded on merit.",
    "FPS": "380"
  },
  {
    "Qualification": "Bachelor Of Arts In Theatre & Performance (Ba(T&P))",
    "Requirements": "NSC endorsed for degree study/ matric exemption. FPS 380 with \nAcademic Literacy NBT score at Intermediate Level. 50% for English (HL) or 60% for English \n(FAL) .  Satisfactory performance in an audition.\nNote : The leading indicator for admission is performance in the audition, and places are \nawarded on merit.",
    "FPS": "380"
  },
  {
    "Qualification": "Bachelor Of Music (Bmus)",
    "Requirements": "NSC endorsed for degree study. FPS 380 with Academic Literacy \nNBT score at Intermediate Level. 50% for English (HL) or 60% for English (FAL).   Satisfactory \nperformance in an audition.  \nNote : The leading indicator for admission is performance in the audition, and places are \nawarded on merit.NSC Music 60% or above\nUnisa Music Theory Grade V or above  \nUnisa Music Practical Grade VII or above\nOnly SA applicants \nin targeted redress \ncategoriesPossible admission\nApplicants below the minimum requirements who excel in \nthe audition evaluation may be considered for admission to a \nFoundation programme or the Diploma in Music Performance.                60      |      2024 UNDERGRADUATE PROSPECTUSADVANCED",
    "FPS": "380"
  },
  {
    "Qualification": "Diploma In Music Performance (Dmp)",
    "Requirements": "NSC endorsed for diploma study. Academic Literacy NBT score at \nIntermediate Level.  50% for English (HL) or 60% for English (FAL).   Satisfactory performance in \nan audition and music theory test.",
    "FPS": "Intermediate or above\nSatisfactory performance in an audition and Music theory test"
  },
  {
    "Qualification": "Diploma In Theatre & Performance (Dtp)",
    "Requirements": "NSC endorsed for diploma study. Academic Literacy NBT score at \nIntermediate Level.  50% for English (HL) or 60% for English (FAL).   Satisfactory performance \nin an audition.",
    "FPS": "Intermediate or above\nSatisfactory performance in an audition\nADVANCED"
  },
  {
    "Qualification": "Diploma In Adult And Community Education And \nTraining (Acet)\nEligible Minimum Requirements\nAll Applicantsan Approved And Recognised Level 6 Diploma In Acet; Or \nA Level 7 Postgraduate Certificate In Education; Or \nA Bed Degree In Acet; Or \nA Historically Equivalent Qualification In Adult Education; Or \nAn Advanced Diploma In Adult And Community Education And \nTraining Teaching; Or\nA New Advanced Certificate (Level 6 On The Current 10-Level \nNqf) Which Followed A Former Diploma In Education (Including \nA National Professional Diploma In Education) May Also Be \nPresented For Admission To An Advanced Diploma; Or\nVia Recognition Of Prior Learning (Rpl)\nAnd At Least Two Years Of Experience As Adult Community \nEducators And Trainers.Admission Criteria For Applicants With Non-South African \nSchool-Leaving Qualifications\nApplications Are Also Invited From Those Who Have Successfully Completed A Non-South African \nSecondary School-Leaving Qualification. To Be Considered For Admission, All Applicants Must \nQualify For Matriculation Exemption From The Matriculation Board. The Criteria Specified For \nMatriculation Exemption Are The Minimum Entry Requirements And Do Not Guarantee Admission. \nThe Sole Subject Requirement For All Qualifications Is English For Which A Pass Is Required For \nAdmission. Some Qualifications May Carry Additional Subject Requirements, And Particular \nSubjects May Also Be Required For Matriculation Exemption.\nAdmission Is Competitive And Each Application Is Evaluated Individually On Its Merits. Assessment \nIs Based On Performance In The Top Six Secondary School Leaving Subjects, That Must Include \nEnglish But Excluding Life Orientation And Any Of The Ap Subjects Beginning With The Most Senior \nSubject Passed. A Points Rating System Is Used To Guide Admission Decisions. The Aps In The \nTables Below Reflect The Level At Which You Are Likely To Receive An Offer. While Your Application \nIs Assessed With Reference To Your Aps, Additional Factors May Be Taken Into Account And Each \nApplication Is Considered On Its Individual Merits, Particularly For Admission To Qualifications In \nThe Performing And Creative Arts.\nAll Applicants Who Are Normally Resident, Or At School, In South Africa Must Write The Nbt. As \nThe Nbt Assesses Entry-Level Academic Proficiency, Applicants Are Expected To Attain A Proficient \nScore On The Academic Literacy Portion Of The Test.\nThe Following Information Is A Guide For Applicants With Cambridge Assessment International \nEducation (Caie) And The International Baccalaureate Diploma (Ib) School-Leaving Qualifications. \nCaie Applicants With Only Gcse/ Igsce/ Levels Subjects Are Not Eligible For Admission.\nGeneral Certificate Of Education Advanced And Advanced \nSubsidiary (Gce A-Level And As-Level) Applicants\nTo Meet The Minimum Requirements For Matriculation Exemption, Applicants Must Hold At Least \nTwo A-Level Subjects At A Grade Of E Or Above And At Least Three Igsce/ Gsce Subjects At A \nGrade Of C Or Above Including English Language And An Approved Second Language.  Where An \nApplicant Does Not Hold A-Levels, At Least Four As-Levels Are Required At Grade D Or Above And At \nLeast One Approved Igsce/ Gsce Subject At A Grade Of C Or Above Including English Language \nAnd An Approved Second Language.  \nIt Is Important To Note That Matriculation Exemption Requires Specific Subject Combinations And \nThat Certain Subjects Are Not Recognised. To Qualify For Admission To Humanities Qualifications, \nApplicants Should Have Passed Two A-Level Subjects At Grade C Or Above. Where An Applicant \nHas Not Completed A-Level Subjects, As-Levels May Be Accepted At The Rate Of Two As-Levels For \nEach Required A-Level.",
    "Requirements": "It is an entry level, non-professional qualification for those who \nhave at least two years practitioner experience but no education and training at this level."
  }
]